{
  "backend/main.mo": "Defines the actor canister with storage mixins and extensive type definitions for members, profiles, transactions, withdrawals, products, purchases, and contact forms.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains pre-written summaries of multiple frontend files, describing their purpose and functionality.",
  "frontend/docs/custom-domain.md": "Documentation explaining how to configure and register custom domains for the frontend canister, including apex and www setup steps.",
  "frontend/index.css": "Tailwind-based global styling defining light/dark theme variables and component base styles using OKLCH colors.",
  "frontend/index.html": "Main HTML entry point setting canonical domain metadata, Open Graph tags, favicon, and a pre-load redirect script to the canonical domain.",
  "frontend/public/.well-known/ic-domains": "Allowlist file specifying the frontend’s permitted IC gateway domains for apex and www hostnames.",
  "frontend/src/App.tsx": "Root React component handling authentication state, profile checks, routing, UI layout, and role-protected navigation.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar rendering role-aware tabs and handling authenticated vs unauthenticated navigation.",
  "frontend/src/components/Footer.tsx": "Renders a styled footer with marketing text, contact info, and social media icons.",
  "frontend/src/components/Header.tsx": "Displays the main navigation header with authentication handling, role-based links, and mobile menu support.",
  "frontend/src/components/KomisiCalculator.tsx": "Provides an interactive incentive calculator based on selected package pricing and predefined commission categories.",
  "frontend/src/components/MemberDetailModal.tsx": "Shows a detailed modal with member info, transactions, commissions, and a network tree for downline visualization.",
  "frontend/src/components/NetworkTreeVisualization.tsx": "Draws a hierarchical family tree on a canvas to visualize user network levels and relationships.",
  "frontend/src/components/OnboardingStepper.tsx": "Displays a step-by-step onboarding guide with progress indicators and navigation triggers.",
  "frontend/src/components/PreWhatsAppContactForm.tsx": "Modal form that collects customer info, fetches product data, detects geolocation with retry, and submits data before opening WhatsApp.",
  "frontend/src/components/ProductDetailModal.tsx": "Displays detailed product info including pricing, commission, and styled feature sections inside a modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Multi-step profile setup modal with address auto-fill, role-based behavior, and submission via backend mutation.",
  "frontend/src/components/PurchaseModal.tsx": "Empty placeholder file for a purchase modal component.",
  "frontend/src/components/RouteGuard.tsx": "Guards routes by checking authentication and user role, showing loading or access-denied states when necessary.",
  "frontend/src/components/WithdrawalRequestModal.tsx": "Handles withdrawal requests, validates input, triggers backend mutation, and opens WhatsApp with pre-filled message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login flow, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useOnboardingSteps.ts": "Generates onboarding steps based on user authentication, role, registration, profile completeness, and verification, with optional navigation actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calling backend actor methods to manage profiles, roles, admin checks, and member data with cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light/dark theme variables with a neon-style palette and utility classes.",
  "frontend/src/lib/addressData.ts": "Provides mocked Indonesian address data including countries, provinces, cities, and postal code structure.",
  "frontend/src/lib/productCatalog.ts": "Maps product names to UI metadata such as icons and gradient colors, with a helper to fetch defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Landing page with hero section and feature highlights, handling login and navigation to join or dashboard based on user state.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface for managing members, products, withdrawals, and viewing leaderboards with multiple tabs and modals.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page rendering the KomisiCalculator component for commission estimation.",
  "frontend/src/pages/DashboardPage.tsx": "Member dashboard showing profile, transactions, family tree, withdrawals, and onboarding with login handling.",
  "frontend/src/pages/HomePage.tsx": "Public homepage with hero section, product listing, onboarding steps, product bootstrap logic, and login-to-join flow.",
  "frontend/src/pages/JoinPage.tsx": "User registration page handling Internet Identity login, form submission, and redirects if already registered.",
  "frontend/src/pages/NetworkPage.tsx": "React page that authenticates the user, loads their family tree, shows downline stats, and renders a network visualization with Tailwind-styled UI states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URL/hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and theme settings for the app’s neon-styled UI.",
  "project_state.json": "Metadata describing the project’s version, architecture, known issues, and functional scope for the MyRepublic Network Hub dApp."
}