{
  "backend/main.mo": "Main Motoko canister defining core domain types (members, profiles, products, transactions, withdrawals, purchases, contact forms, MLM tree) and state maps, and mixing in blob storage and authorization logic for an MLM-style backend.",
  "feature_evidence.json": "Machine-readable report documenting implemented frontend features related to product ID consistency and resilient product fetching, listing affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of major frontend files, describing each component’s purpose, UI behavior, hooks, pages, and styling decisions for build and review reference.",
  "frontend/index.css": "Global Tailwind CSS base defining light/dark theme design tokens using OKLCH colors, neon/purple styling, and shared layout utilities applied across the app.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, document title, and mounting the React application at the root element.",
  "frontend/src/App.tsx": "Top-level React application component managing authentication state, role-based routing, page navigation, profile completion modal logic, and overall layout with header/footer.",
  "frontend/src/components/BottomNav.tsx": "Mobile-only bottom navigation bar rendering role- and auth-aware tabs with icons, active-state styling, and optional admin access.",
  "frontend/src/components/Footer.tsx": "Renders a stylized footer with branding, contact information, social media links, and decorative gradients/icons. Uses react-icons and lucide-react for visuals and includes copyright and external credit links.",
  "frontend/src/components/Header.tsx": "Implements the main site header with logo, navigation, authentication handling, and role-based menu items. Integrates Internet Identity login/logout, user profile queries, and responsive desktop/mobile navigation.",
  "frontend/src/components/KomisiCalculator.tsx": "Provides an interactive commission calculator that computes earnings based on selected internet packages or custom price. Displays detailed incentive breakdowns across multiple commission categories with rich visual styling.",
  "frontend/src/components/MemberDetailModal.tsx": "Displays a modal with detailed member information including profile data, transaction history, commission summaries, and network statistics. Fetches transactions and family tree data and includes tabbed views and a network visualization.",
  "frontend/src/components/NetworkTreeVisualization.tsx": "Draws a hierarchical network/family tree on an HTML canvas using recursive rendering. Visualizes member levels with color-coded nodes and connecting lines.",
  "frontend/src/components/OnboardingStepper.tsx": "Shows a step-by-step onboarding guide for new users based on dynamic onboarding status. Integrates authentication state and visually distinguishes completed, current, and upcoming steps.",
  "frontend/src/components/PreWhatsAppContactForm.tsx": "Modal form that collects customer details and geolocation before initiating WhatsApp contact for a product, including location detection, validation, and submission via backend mutation.",
  "frontend/src/components/ProductDetailModal.tsx": "Displays detailed information about a product package in a styled modal, including price, speed, commission calculation, and visual highlights.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup with personal, address, and bank details, featuring dynamic address selection, admin-specific logic, and profile save mutation.",
  "frontend/src/components/PurchaseModal.tsx": "File exists but currently contains no implementation or content.",
  "frontend/src/components/RouteGuard.tsx": "Route protection component that checks authentication and user role, showing loading or access-denied states and optionally triggering an unauthorized callback.",
  "frontend/src/components/WithdrawalRequestModal.tsx": "Modal to request balance withdrawal, validating amount, submitting a withdrawal mutation, and opening WhatsApp with a prefilled admin message on success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on Internet Identity, initializes access control, and refreshes dependent React Query queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook to manage Internet Identity authentication using Dfinity AuthClient, exposing identity state, login/logout actions, and detailed login status flags.",
  "frontend/src/hooks/useOnboardingSteps.ts": "Implements a hook that derives a step-by-step onboarding flow based on authentication state, user profile data, role, and verification status, returning ordered steps and the current step index.",
  "frontend/src/hooks/useQueries.ts": "Provides a collection of React Query hooks for interacting with backend actors, including user registration, profile management, role checks, and various data fetches with cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind CSS base, component, and utility layers with extensive CSS variables for a neon-themed light and dark design system, including colors, charts, and glow effects.",
  "frontend/src/lib/addressData.ts": "Exports mocked Indonesian address reference data, including countries, provinces, and province-to-city mappings, along with related TypeScript interfaces.",
  "frontend/src/lib/productCatalog.ts": "Defines a UI catalog mapping backend product names to icons and gradient colors, with a helper to safely retrieve metadata for a given product.",
  "frontend/src/main.tsx": "Bootstraps the React application by creating the root, applying global styles, and wrapping the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Public marketing page describing the platform’s benefits and incentives, with a CTA that logs in users and navigates them to join or dashboard based on profile state.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard for managing products, members, leaderboards, and withdrawal approvals, including search, sorting, modals, and multiple data tabs.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page that presents a commission calculator component with a title and explanatory text.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated member dashboard showing profile status, commissions, downlines, transactions, withdrawals, and onboarding, with login and loading states handled.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying onboarding steps, hero content, and product listings, handling login, navigation to join or dashboard, and product detail/subscription modals.",
  "frontend/src/pages/JoinPage.tsx": "Member registration page that handles Internet Identity login, role checks, profile existence, and submission of basic member details with success and error states.",
  "frontend/src/pages/NetworkPage.tsx": "React page that displays the authenticated user's network/family tree, including login gating, loading states, summary stats (e.g., direct downlines), and a visualization component. It uses Internet Identity for auth and a query hook to fetch the family tree data.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and retrieving or clearing them safely. Supports persisted URL parameters and removal of sensitive hash parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and extensive theme extensions for colors, shadows, radii, animations, and neon styles. Integrates official Tailwind plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the MyRepublic Network Hub ICP dApp, including overall architecture, feature summary, and a versioned list of implemented features such as authentication, RBAC, member registration, profile completion, and network tree viewing."
}