{
  "backend/main.mo": "Defines the backend actor with member, product, transaction, withdrawal, and contact form types plus storage maps for profiles, transactions, and withdrawals.",
  "feature_evidence.json": "Lists implemented features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their functionality and purpose.",
  "frontend/docs/custom-domain.md": "Empty placeholder file for custom domain documentation.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, dark mode overrides, and global styles.",
  "frontend/index.html": "Main HTML entry defining metadata, favicon, canonical URL, and loading the React application.",
  "frontend/public/.well-known/ic-domains": "Empty file reserved for IC domain configuration.",
  "frontend/src/App.tsx": "Root React component handling authentication, URL‑synced routing, role-based access, and profile completion modal logic.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with role-aware admin tab and route navigation behavior.",
  "frontend/src/components/Footer.tsx": "Renders a multi‑section gradient footer with branding, contact info, and social media icons. Includes decorative backgrounds and a copyright line.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with navigation, login/logout handling, and dynamic menu items based on authentication and admin role.",
  "frontend/src/components/KomisiCalculator.tsx": "Provides a real‑time incentive calculator that computes earnings across five commission categories based on selected or custom package pricing.",
  "frontend/src/components/MemberDetailModal.tsx": "Displays a detailed modal with member profile data, transaction history, commission summaries, and network tree info.",
  "frontend/src/components/NetworkTreeVisualization.tsx": "Draws a family tree on a canvas, rendering nodes and connector lines to visualize network hierarchy levels.",
  "frontend/src/components/OnboardingStepper.tsx": "Shows a step‑by‑step onboarding guide with dynamic step states and optional navigation actions, hidden for admin users.",
  "frontend/src/components/PreWhatsAppContactForm.tsx": "Modal form that collects customer info, fetches product data, detects geolocation with retries, and submits data before opening WhatsApp.",
  "frontend/src/components/ProductDetailModal.tsx": "Displays detailed product information including price, speed, commission, and features in a styled modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating a user profile with address autofill, role-based fields, and submission via backend mutation.",
  "frontend/src/components/PurchaseModal.tsx": "Empty placeholder file for a purchase modal component.",
  "frontend/src/components/RouteGuard.tsx": "Guards routes by validating authentication and user roles, showing alerts or blocking access when unauthorized.",
  "frontend/src/components/WithdrawalRequestModal.tsx": "Handles balance withdrawal requests, triggers a WhatsApp message to admin, and validates input and request status in a modal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and restoring identities.",
  "frontend/src/hooks/useOnboardingSteps.ts": "Builds a sequence of onboarding steps based on authentication, profile status, and verification, with navigation actions for each step.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods to manage user profiles, roles, admin checks, and related data.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light/dark theme variables with neon-inspired color tokens and utility classes.",
  "frontend/src/lib/addressData.ts": "Contains mock Indonesian address data including countries, provinces, cities, and postal code structures.",
  "frontend/src/lib/productCatalog.ts": "Maps product names to UI metadata such as icons and gradient colors and provides a helper to retrieve metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Landing page with hero section promoting joining, showing animated visuals and handling login and navigation logic.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard providing product management, member management, withdrawal approvals, leaderboards, and admin-only tools.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page rendering the KomisiCalculator component with a title and description.",
  "frontend/src/pages/DashboardPage.tsx": "Member dashboard showing profile, transactions, network data, withdrawals, and onboarding guidance with login handling.",
  "frontend/src/pages/HomePage.tsx": "Home page with onboarding, hero section, product listing, subscription handling, and optional admin product bootstrapping.",
  "frontend/src/pages/JoinPage.tsx": "Registration page for new members with login gating, form submission, success state, and redirect if already registered.",
  "frontend/src/pages/NetworkPage.tsx": "Renders the network tree page, handling authentication, loading state, and displaying user downline stats and visualization.",
  "frontend/src/utils/clientRouting.ts": "Provides client-side routing helpers for mapping page types to paths and syncing navigation with browser history.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and container settings for the app's UI style.",
  "project_state.json": "Describes the project’s current state, architecture, domain rules, and known issues for the MyRepublic Network Hub dApp."
}