{
  "backend/main.mo": "Defines the main actor with data models for members, profiles, transactions, withdrawals, products, purchases, and network structures, and initializes storage maps.",
  "feature_evidence.json": "Lists feature evidence entries describing domain-removal changes, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summary descriptions of various frontend files and their functionality.",
  "frontend/docs/custom-domain.md": "Empty documentation file intended for custom-domain instructions.",
  "frontend/index.css": "Global Tailwind-based style definitions including light/dark theme variables and base styling rules.",
  "frontend/index.html": "Main HTML entry file setting canonical and Open Graph URLs to the default Caffeine domain and loading the React app.",
  "frontend/public/.well-known/ic-domains": "Empty custom-domain allowlist file for IC domain configuration.",
  "frontend/src/App.tsx": "Top-level React component handling identity initialization, routing, role checks, and profile-completion modal behavior.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with role‑based admin tab, icon buttons, and page navigation handling.",
  "frontend/src/components/Footer.tsx": "Renders a stylized footer with branding, contact info, and social media links using decorative gradients and icons.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, authentication handling, and responsive mobile menu logic.",
  "frontend/src/components/KomisiCalculator.tsx": "Implements an incentive calculator that computes commissions based on selected MyRepublic packages or custom pricing.",
  "frontend/src/components/MemberDetailModal.tsx": "Displays a modal showing detailed member info, transactions, commissions, and a network tree view.",
  "frontend/src/components/NetworkTreeVisualization.tsx": "Draws a hierarchical family tree on a canvas, visualizing downline network levels.",
  "frontend/src/components/OnboardingStepper.tsx": "Shows a multi-step onboarding guide indicating user progress with dynamic status and navigation.",
  "frontend/src/components/PreWhatsAppContactForm.tsx": "Handles a modal form for submitting customer contact details and geolocation before opening WhatsApp, including product fetching and retry logic.",
  "frontend/src/components/ProductDetailModal.tsx": "Displays detailed product information in a styled modal, including price, features, and commission calculation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a multi-field profile setup form with dynamic address handling and role-specific behavior for saving user profiles.",
  "frontend/src/components/PurchaseModal.tsx": "Empty placeholder component file for a purchase modal.",
  "frontend/src/components/RouteGuard.tsx": "Guards routes based on authentication and user role, showing loading and error states when access is restricted.",
  "frontend/src/components/WithdrawalRequestModal.tsx": "Handles withdrawal requests, triggers WhatsApp messaging with request details, and displays success or error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider, handling identity loading, login, logout, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useOnboardingSteps.ts": "Computes a user's onboarding steps based on authentication, registration, profile completion, and verification status, with optional navigation actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the backend actor, including profile, role, admin checks, registration, and profile updates.",
  "frontend/src/index.css": "Configures Tailwind styles and theme variables for light and dark modes, including a neon color palette and utility classes.",
  "frontend/src/lib/addressData.ts": "Contains static Indonesian address data including countries, provinces, city mappings, and postal code types.",
  "frontend/src/lib/productCatalog.ts": "Maps product names to UI metadata like icons and gradient colors, with a helper to retrieve metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Landing page with animated hero section and call-to-action that handles login and navigation based on authentication and profile status.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface for managing leaderboard data, products, members, and withdrawals with CRUD actions and modal controls.",
  "frontend/src/pages/CalculatorPage.tsx": "Simple page that displays a commission calculator component.",
  "frontend/src/pages/DashboardPage.tsx": "Member dashboard showing profile, transactions, network data, withdrawals, and verification status with login handling.",
  "frontend/src/pages/HomePage.tsx": "Home page with onboarding, product listing, auto-bootstrap logic, and navigation based on authentication and user profile.",
  "frontend/src/pages/JoinPage.tsx": "Registration page that manages member signup with login prompts, validation, and post-registration navigation.",
  "frontend/src/pages/NetworkPage.tsx": "Renders the network tree page, handling authentication, loading states, and displaying downline stats with a visualization component.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and container settings with custom neon-themed design tokens.",
  "project_state.json": "Describes the project’s current architecture, features, business rules, and known issues for the MyRepublic Network Hub dApp."
}