{
  "kind": "build_request",
  "title": "Enable apex custom domain by adding myrepubicnetwork.web.id to ic-domains and documenting redeploy + gateway registration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Add an `ic-domains` allowlist file to the frontend assets so the deployed frontend canister explicitly serves both the apex and www hostnames: `myrepubicnetwork.web.id` and `www.myrepubicnetwork.web.id`. The file must be included in the built static assets so it is available from the frontend canister at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tambah myrepubicnetwork.web.id ke file ic-domains di canister"
        ]
      },
      "acceptanceCriteria": [
        "A new static asset file is added under the frontend public assets (use the standard IC well-known location) containing newline-separated domains including `myrepubicnetwork.web.id` and `www.myrepubicnetwork.web.id`.",
        "After building the frontend, the `ic-domains` file is present in the final canister assets at `/.well-known/ic-domains` (or the IC-supported path used by the asset canister) and returns the expected contents when fetched.",
        "No changes are made to any frontend immutable paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update repository documentation to include the exact post-deploy steps required to activate the apex/root custom domain on the ICP gateway, including a separate POST registration for `myrepubicnetwork.web.id` (in addition to any existing `www` registration), and explicitly call out that a redeploy is required after updating `ic-domains`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Deploy ulang",
          "Register root domain via POST (curl) secara terpisah"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/docs/custom-domain.md` is updated to include a clear section for enabling the apex/root domain, including: (1) add domain to `ic-domains`, (2) redeploy the frontend canister, (3) run `curl -X POST -H 'Content-Type: application/json' https://icp0.io/registrations --data '{\"name\": \"myrepubicnetwork.web.id\"}'` as a separate step.",
        "Documentation also includes the analogous POST registration command for `www.myrepubicnetwork.web.id` (if not already present) and clarifies that `www` and apex are separate registrations.",
        "Documentation includes a verification step using `https://icp0.io/registrations/<id>` to check status (e.g., pending/available/failed)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; no multi-canister backend changes.",
    "Do not modify files under frontend immutablePaths (SYSTEM_CONTEXT)."
  ],
  "nonGoals": [
    "Do not implement DNS provider automation or Cloudflare API integration.",
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not change canonical domain behavior already implemented in frontend/index.html unless required for the apex domain activation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}