{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 23,
  "summary": "MyRepublic Network Hub adalah dApp ICP (Motoko backend + React/Tailwind frontend) untuk program member/referral MyRepublic, termasuk autentikasi Internet Identity, registrasi & profil detail, visualisasi network tree, transaksi komisi/bonus, dan penarikan dana; admin mengelola produk, member, leaderboard, dan proses withdrawal. Arah bisnis diperbarui: skema komisi referral pembelian pertama menjadi 25% dari harga produk untuk referrer, dan member baru dapat langsung merekrut tanpa harus menunggu status verifikasi langganan. Scope domain direvisi: proyek TIDAK menggunakan custom domain dan tetap memakai link default https://myrepublic-tuk.caffeine.xyz (tanpa konfigurasi `ic-domains`, tanpa canonical redirect/OG URL custom, dan tanpa dokumentasi/steps domain ICP gateway).",
  "architectural_notes": [
    "Frontend uses React + @tanstack/react-query with a dedicated hooks layer (useQueries.ts) to wrap all canister calls, with query-key based caching and targeted invalidation after mutations.",
    "Internet Identity authentication is wrapped in a context provider (useInternetIdentity) that initializes AuthClient, persists delegation, and exposes login/logout state to the app.",
    "Actor creation is centralized in useActor; it creates an anonymous actor when unauthenticated and an authenticated actor when logged in; it also initializes access control via _initializeAccessControlWithSecret using a secret token extracted from URL hash/session.",
    "Role-based UI and routing are implemented via RouteGuard plus conditional navigation items (Header/BottomNav) that show the Admin tab only for admin users.",
    "Backend (Motoko) uses mixins (MixinAuthorization, blob-storage/Mixin) to compose authorization and storage-related endpoints into the main actor.",
    "Backend state is held in mo:core Map and List collections keyed primarily by Principal or Nat IDs (profiles, transactions, withdrawals, products, purchases, achievements, contact form submissions).",
    "Access control is implemented with an AccessControl state map; the first caller providing the correct admin token becomes admin; others become users; admin-only operations are enforced via explicit validation helpers.",
    "Backend includes upgrade migration support via (with migration = Migration.run) to evolve stored profile fields (adds subscriptionsVerified).",
    "UI is built with Tailwind CSS + shadcn/ui-style components, with an extensive neon purple/gold theme and custom animations in tailwind.config.js and src/index.css.",
    "Network visualization is a canvas-based renderer drawing a hierarchical tree from backend-provided FamilyTreeNode data."
  ],
  "known_issues": [
    "Backend commission logic appears to credit upline commissions and sponsor bonuses but does not record a direct/personal sales commission for the seller in the transactions ledger (the UI and incentive descriptions emphasize personal sales). This may be a functional gap or mismatch between marketing copy and implementation.",
    "backend/blob-storage/Storage.mo references env var \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (note spelling with triple 'F'); if deployment uses a different spelling this will trap at runtime.",
    "AccessControl.getUserRole traps with \"User is not registered\" for principals not yet initialized; the frontend mitigates this by calling _initializeAccessControlWithSecret when creating an authenticated actor, but any flow that queries role before initialization could trap.",
    "NetworkTreeVisualization uses fixed layout constants (height=600, horizontal spacing=150) and may not scale/fit for large/wide networks (overflow, nodes off-screen).",
    "Form berlangganan masih kadang gagal memuat data paket/harga (muncul pesan: \"⚠️ Paket tidak dapat dimuat. Harap tutup dan buka kembali formulir ini.\"), mengindikasikan fetch product/detail paket atau state pemilihan produk tidak konsisten/putus sehingga form tidak bisa menampilkan paket yang dipilih.",
    "After publishing v55, products and the Admin dashboard may not appear even after Internet Identity login; likely related to auth/role initialization (AccessControl) and/or product bootstrap/fetch flow causing UI to render as empty/non-admin."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout + persisted delegation)",
      "synonyms": [
        "II login",
        "AuthClient integration"
      ],
      "description": "Provides an authentication context backed by Dfinity AuthClient, exposing identity, login/logout actions, and detailed login status flags; loads existing delegation on app startup and supports long-lived sessions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Actor creation and canister initialization with access-control secret",
      "synonyms": [
        "useActor",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Creates an ICP canister actor (anonymous or authenticated) and initializes backend access control using a secret token sourced from the URL hash/session; invalidates and refetches dependent React Query data when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control (admin/user/guest)",
      "synonyms": [
        "AccessControl",
        "RBAC"
      ],
      "description": "Backend maintains a role map; first valid admin-token initializer can become admin; supports querying current role, checking admin status, and assigning roles (admin-only). Frontend consumes role to show/hide admin navigation and protect routes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Route protection and role-gated pages",
      "synonyms": [
        "RouteGuard",
        "protected routes"
      ],
      "description": "Frontend enforces authentication and optional admin role before rendering protected pages, showing user-friendly unauthorized messages and optionally redirecting on unauthorized admin access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Member registration (basic)",
      "synonyms": [
        "Join flow",
        "registerMember"
      ],
      "description": "Authenticated users can register as members using basic fields (name, contact). Backend creates a MemberProfile with incomplete status for regular users and complete/verified status for admins.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Profile completion workflow with validation and Indonesian address helpers",
      "synonyms": [
        "ProfileSetupModal",
        "saveCallerUserProfile"
      ],
      "description": "After registration, non-admin users are prompted to complete a sealed profile including sponsor Principal, unique NIK KTP, birth info, WhatsApp number, bank account, and address data. UI includes mocked Indonesian provinces/cities/postal codes and auto-constructs full address and domicile address.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Sponsor/referral linkage and NIK uniqueness enforcement",
      "synonyms": [
        "sponsorId referral",
        "KTP uniqueness"
      ],
      "description": "Backend requires a valid non-anonymous sponsor Principal that already exists in member profiles, and enforces uniqueness of NIK KTP across existing profiles and pending membership requests.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Profile completeness and verification gating",
      "synonyms": [
        "isProfileComplete",
        "subscriptionsVerified gate"
      ],
      "description": "Backend restricts access to key features based on role, profile completion, and a subscriptionsVerified flag. Frontend displays verification badges/alerts and auto-opens the profile completion modal when incomplete (non-admin).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Product catalog and admin product management",
      "synonyms": [
        "Products",
        "addProduct",
        "initializeDefaultInternetPackages"
      ],
      "description": "Backend stores products (internet packages) with price and commission rate, supports fetching single/all products, and allows admins to add products and initialize default MyRepublic packages. Frontend displays package cards and admin product management UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Subscription/contact initiation via pre-WhatsApp form with geolocation",
      "synonyms": [
        "PreWhatsAppContactForm",
        "submitPreWhatsAppContactForm"
      ],
      "description": "Users fill a subscription/contact form that captures customer details, GPS coordinates, and a product ID; submission is recorded on-chain and then a pre-filled WhatsApp chat to the admin number is opened. The frontend validates product details by fetching the product from the backend to prevent mismatches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Purchase recording and commission distribution to uplines",
      "synonyms": [
        "processPurchaseWithCommissions",
        "upline commissions"
      ],
      "description": "Backend can create a purchase (pending) and distribute commissions up the sponsor chain using level-based basis-point rates, plus a separate sponsor bonus. Purchase processing also marks the seller as subscriptionsVerified.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Transactions ledger (commission + sponsor bonus) retrieval and display",
      "synonyms": [
        "getTransactions",
        "commission history"
      ],
      "description": "Backend records commission transactions for uplines (commissionAmount) and sponsor bonuses (sponsorBonus) and allows member/admin retrieval (with authorization). Frontend shows recent transactions and computes totals and breakdowns.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Network/family tree generation and visualization",
      "synonyms": [
        "getFamilyTree",
        "downlines tree"
      ],
      "description": "Backend builds a recursive FamilyTreeNode structure based on sponsor relationships. Frontend renders the tree on a canvas with level color-coding and shows network stats (e.g., direct downlines).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Withdrawals: member requests + admin processing workflow",
      "synonyms": [
        "requestWithdrawal",
        "approve/reject/paid"
      ],
      "description": "Members can request withdrawals (with balance checks and bank account requirement). Admins can list all/pending withdrawals and approve, reject, or mark approved withdrawals as paid. Frontend provides a member withdrawal modal that also opens WhatsApp to contact admin and an admin dashboard tab to process requests.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Withdrawal summary and history",
      "synonyms": [
        "getMemberWithdrawalSummary",
        "getMemberWithdrawals"
      ],
      "description": "Backend computes a per-member summary (available balance, totals by withdrawal status) and per-member withdrawal history with authorization checks. Frontend uses these to display available balance and recent withdrawal records.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Leaderboards (sales volume and downline count)",
      "synonyms": [
        "getLeaderboard",
        "rankings"
      ],
      "description": "Backend computes leaderboard entries for sales volume (from salesRecords) and direct downline count (from sponsor relationships). Frontend admin dashboard displays top entries for both categories.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Admin member management and export",
      "synonyms": [
        "getAllMembers",
        "CSV export",
        "member inspection"
      ],
      "description": "Admins can fetch all member profiles, search/filter/sort/paginate them in the UI, export member data to CSV, and open a member detail modal for deeper inspection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Membership requests and admin approval/rejection (backend)",
      "synonyms": [
        "submitMembershipRequest",
        "approveMembershipRequest"
      ],
      "description": "Backend supports creating membership requests (requires verified member), and admin approval/rejection of requests. (UI integration is not clearly present in provided frontend files, but endpoints and state are implemented.)",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Achievements tracking (backend)",
      "synonyms": [
        "recordAchievement",
        "getAchievements"
      ],
      "description": "Members can record achievements with timestamps; achievements can be queried by the owning member or admins.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Blob storage lifecycle and gateway authorization mixin (backend utility)",
      "synonyms": [
        "caffeine storage mixin",
        "blob GC"
      ],
      "description": "Includes canister endpoints for managing storage gateway principals, listing dead blobs, confirming deletions and triggering GC, and cashier cycle refills; designed for integration with a storage gateway/cashier canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "HTTP outcalls helper (backend utility)",
      "synonyms": [
        "http_request wrapper",
        "transform"
      ],
      "description": "Provides reusable GET/POST HTTP outcall helpers using the IC management canister, including a response transform that strips headers and a fixed cycles budget for requests.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Theme settings endpoint (backend)",
      "synonyms": [
        "getThemeSettings"
      ],
      "description": "Backend exposes a static theme configuration (purple theme) that can be used by clients for theming.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Recruiting/referral eligibility gated by verified subscription",
      "synonyms": [
        "subscriptionsVerified sponsor gate",
        "verified-only sponsoring"
      ],
      "description": "Only members with subscriptionsVerified=true can be used as a valid sponsor/referral and/or submit membership/recruiting flows; backend validations reject unverified sponsors to prevent recruiting until a package subscription is verified.",
      "reqIds": [
        "AR-1"
      ],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Verified subscription (“Terverifikasi”) status badge in member UI",
      "synonyms": [
        "Terverifikasi badge",
        "verified member status"
      ],
      "description": "Frontend surfaces a clear verified status indicator/badge once the member’s subscriptionsVerified flag is set (e.g., after successful purchase/subscription processing), making verification state visible across relevant screens.",
      "reqIds": [
        "AR-2"
      ],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Purchase modal UI implementation",
      "synonyms": [
        "PurchaseModal",
        "purchase flow UI"
      ],
      "description": "Implements the previously-empty PurchaseModal component so purchases/subscriptions can be initiated/recorded via a functional UI rather than a placeholder component.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-ensure-the-frontend-consistently-treats-https-myrepubicnetwork-web-id-as-the-canonical-domain-by-a-keeping-frontend-index-html-canonical-open-graph-url-tags-pointing-to-https-myrepubicnetwork-web-id-and-b-adding-an-optional-runtime-canonical-redirect-so-that-when-the-app-is-opened-on-a-non-local-non-canonical-hostname-e-g-an-icp0-io-url-it-redirects-to-the-same-path-on-https-myrepubicnetwork-web-id",
      "title": "Ensure the frontend consistently treats `https://myrepubicnetwork.web.id` as the canonical domain by (a) keeping `frontend/index.html` canonical + Open Graph URL tags pointing to `https://myrepubicnetwork.web.id`, and (b) adding an optional runtime canonical redirect so that when the app is opened on a non-local, non-canonical hostname (e.g., an `*.icp0.io` URL), it redirects to the same path on `https://myrepubicnetwork.web.id`.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-repository-documentation-file-describing-how-to-connect-the-custom-domain-myrepubicnetwork-web-id-to-the-deployed-ic-frontend-canister-including-dns-records-to-set-expected-propagation-behavior-and-how-to-verify-the-domain-is-serving-the-correct-app-and-tls-certificate",
      "title": "Add a repository documentation file describing how to connect the custom domain `myrepubicnetwork.web.id` to the deployed IC frontend canister, including DNS records to set, expected propagation behavior, and how to verify the domain is serving the correct app and TLS certificate.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-ic-domains-allowlist-file-to-the-frontend-assets-so-the-deployed-frontend-canister-explicitly-serves-both-the-apex-and-www-hostnames-myrepubicnetwork-web-id-and-www-myrepubicnetwork-web-id-the-file-must-be-included-in-the-built-static-assets-so-it-is-available-from-the-frontend-canister-at-runtime",
      "title": "Add an `ic-domains` allowlist file to the frontend assets so the deployed frontend canister explicitly serves both the apex and www hostnames: `myrepubicnetwork.web.id` and `www.myrepubicnetwork.web.id`. The file must be included in the built static assets so it is available from the frontend canister at runtime.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-repository-documentation-to-include-the-exact-post-deploy-steps-required-to-activate-the-apex-root-custom-domain-on-the-icp-gateway-including-a-separate-post-registration-for-myrepubicnetwork-web-id-in-addition-to-any-existing-www-registration-and-explicitly-call-out-that-a-redeploy-is-required-after-updating-ic-domains",
      "title": "Update repository documentation to include the exact post-deploy steps required to activate the apex/root custom domain on the ICP gateway, including a separate POST registration for `myrepubicnetwork.web.id` (in addition to any existing `www` registration), and explicitly call out that a redeploy is required after updating `ic-domains`.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-all-custom-domain-canonical-behavior-so-the-app-is-no-longer-tied-to-myrepubicnetwork-web-id-and-can-be-used-normally-on-the-default-url-https-myrepublic-tuk-caffeine-xyz-update-frontend-index-html-to-1-remove-the-pre-load-canonical-redirect-script-that-forces-myrepubicnetwork-web-id-and-2-set-the-link-rel-canonical-and-og-url-values-to-https-myrepublic-tuk-caffeine-xyz",
      "title": "Remove all custom-domain canonical behavior so the app is no longer tied to `myrepubicnetwork.web.id` and can be used normally on the default URL `https://myrepublic-tuk.caffeine.xyz`. Update `frontend/index.html` to (1) remove the pre-load canonical redirect script that forces `myrepubicnetwork.web.id`, and (2) set the `<link rel='canonical'>` and `og:url` values to `https://myrepublic-tuk.caffeine.xyz`.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-the-ic-custom-domain-allowlist-file-for-myrepubicnetwork-web-id-by-deleting-frontend-public-well-known-ic-domains-or-ensuring-it-no-longer-includes-myrepubicnetwork-web-id-or-www-myrepubicnetwork-web-id-so-the-frontend-canister-is-not-configured-to-serve-that-custom-domain",
      "title": "Remove the IC custom domain allowlist file for `myrepubicnetwork.web.id` by deleting `frontend/public/.well-known/ic-domains` (or ensuring it no longer includes `myrepubicnetwork.web.id` or `www.myrepubicnetwork.web.id`) so the frontend canister is not configured to serve that custom domain.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-custom-domain-documentation-from-the-repository-by-deleting-frontend-docs-custom-domain-md-or-replacing-it-with-a-brief-note-stating-the-project-uses-the-default-caffeine-url-only-https-myrepublic-tuk-caffeine-xyz",
      "title": "Remove custom-domain documentation from the repository by deleting `frontend/docs/custom-domain.md` (or replacing it with a brief note stating the project uses the default Caffeine URL only: `https://myrepublic-tuk.caffeine.xyz`).",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-make-direct-url-navigation-work-by-syncing-the-internal-currentpage-state-with-the-browser-path-so-opening-admin-and-other-pages-loads-the-intended-page-instead-of-rendering-the-default-home-view",
      "title": "Make direct URL navigation work by syncing the internal `currentPage` state with the browser path so opening `/admin` (and other pages) loads the intended page instead of rendering the default Home view.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-prevent-non-admin-users-from-auto-bootstrapping-products-on-the-home-page-only-admins-should-trigger-bootstrapdefaultinternetpackagesifempty-and-non-admins-should-see-a-clear-english-empty-state-when-there-are-no-products",
      "title": "Prevent non-admin users from auto-bootstrapping products on the Home page; only admins should trigger `bootstrapDefaultInternetPackagesIfEmpty`, and non-admins should see a clear English empty-state when there are no products.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-admin-entry-point-is-visible-and-debuggable-when-a-user-is-an-admin-the-admin-tab-button-appears-reliably-when-a-user-is-not-an-admin-navigating-to-admin-shows-an-english-access-denied-message-instead-of-appearing-blank",
      "title": "Ensure the Admin entry point is visible and debuggable: when a user is an admin, the Admin tab/button appears reliably; when a user is not an admin, navigating to Admin shows an English access-denied message instead of appearing blank.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement/confirm recruiting/referral eligibility gating by verified subscription (subscriptionsVerified sponsor gate)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Surface verified subscription (“Terverifikasi”) status badge in member UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update commission scheme: first-time subscription via a referrer grants the referrer 25% of product price",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Allow newly subscribed members to recruit immediately (remove/relax subscriptionsVerified gating for sponsoring/recruiting)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Fix authenticated actor initialization so the app can always create an authenticated actor after Internet Identity login and queries (role/products) do not silently fail when the `caffeineAdminToken` URL parameter is missing or empty.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "MyRepublic Network Hub",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}